# StructConnectionCutback Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructConnectionCutback Property
ParameterTypeId Class See Also
---
"Automatic Cutback for Beams and Braces"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructConnectionCutback { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructConnectionCutback As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructConnectionCutback {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace